server/tests/performance-tests/vehicle-flow.test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 20
      arrivalRate: 1
  processor: "./vehicle-upload-processor.cjs"
  defaults:
    headers:
      Accept: "application/json"

scenarios:
  - name: "CTB Bus Passenger Vehicle CRUD Flow"
    flow:

      # ---------------- LOGIN ----------------
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "john@example.com"
            password: "admin@123"
          capture:
            - json: "$.token"
              as: "authToken"

      - log: "Login successful"
      - think: 1

      # ---------------- CREATE DEPARTMENT ----------------
      - post:
          url: "/api/departments"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            name: "CTB Dept {{ $randomString(6) }}"
            description: "Bus operations"
            managerName: "Sirisena"
            contactNumber: "0777771234"
            email: "ctb{{ $randomNumber(1000,9999) }}@test.com"
            address: "Colombo"
            region: "Western"
            status: "active"
          capture:
            - json: "$._id"
              as: "deptId"

      - log: "Department Created: {{ deptId }}"
      - think: 1

      # ---------------- CREATE VEHICLE ----------------
      - function: "createVehicleWithImage"

      - log: "Vehicle Created: {{ vehicleId }}"
      - think: 1

      # ---------------- SAFE GUARD ----------------
      - log: "Checking vehicleId before next steps: {{ vehicleId }}"

      # ---------------- GET ALL VEHICLES ----------------
      - get:
          url: "/api/vehicles?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"

      - log: "Fetched all vehicles"
      - think: 1

      # ---------------- GET BY ID ----------------
      - get:
          url: "/api/vehicles/{{ vehicleId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"

      - log: "Fetched vehicle by ID"
      - think: 1

      # ---------------- UPDATE ----------------
      - put:
          url: "/api/vehicles/{{ vehicleId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            status: "UNDER MAINTENANCE"
            lastMaintenance:
              date: "2026-02-15T00:00:00.000Z"
              maintenanceType: "Engine"
              odometer: 45000
            nextMaintenanceDue:
              date: "2026-05-15T00:00:00.000Z"
              odometer: 50000

      - log: "Vehicle Updated"
      - think: 1

      # ---------------- DELETE ----------------
      - delete:
          url: "/api/vehicles/{{ vehicleId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"

      - log: "Vehicle Deleted"